app/controllers/admin/basentas_controller.rb

SELECT "basentas".* FROM "basentas"
---
    def index
      @basentas = Basenta.all

SELECT "basentas".* FROM "basentas" WHERE "basentas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
      @basenta = Basenta.find(params[:id])

INSERT INTO "basentas" ("name", "location", "contact_person", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Test Basenta"], ["location", "Tst B Loc"], ["contact_person", "Test Contact Person"], ["created_at", "2024-08-17 17:27:59.424726"], ["updated_at", "2024-08-17 17:27:59.424726"]]
---
    def create
      @basenta = Basenta.new(basenta_params)
      if @basenta.save