app/controllers/admin_dashboard_controller.rb

SELECT COUNT(*) FROM "new_converts"
SELECT COUNT(*) FROM "basentas"
SELECT COUNT(*) FROM "users"
---
  def index
    @total_new_converts = NewConvert.count
    @total_basentas = Basenta.count
    @total_users = User.count