app/controllers/new_converts_controller.rb

SELECT "new_converts".* FROM "new_converts"
---
  def index
    @new_converts = NewConvert.all

INSERT INTO "new_converts" ("name", "gender", "date_of_birth", "contact_number_1", "contact_number_2", "house_number", "landmark", "area", "city", "other_contact_name", "other_contact_number", "other_contact_relationship", "inviter_name", "inviter_contact", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"
---
  def create
    @new_convert = NewConvert.new(new_convert_params)
    if @new_convert.save

SELECT "new_converts".* FROM "new_converts" WHERE "new_converts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @new_convert = NewConvert.find(params[:id])