app/views/new_converts/new.html.erb

SELECT "basentas".* FROM "basentas"
---
        <div class="form-floating mb-3">
          <%= f.collection_select :basenta_id, Basenta.all, :id, :name, {}, class: "form-control", id: "floatingBasenta" %>